app/Http/Controllers/CourseController.php

    public function show(Course $course) {
        $course->load("units", "students", "reviews.author");
---
select * from `reviews` where `reviews`.`course_id` in (1)

    public function storeReview(Course $course) {
        $reviewed = $course->reviews->contains('user_id', auth()->id());
        if ($reviewed) {
            return redirect(route("courses.learn", ["course" => $course]))
                ->with("message", ["danger", __("No puedes valorar este curso, ya lo has hecho antes")]);
---
select * from `reviews` where `reviews`.`course_id` = 1 and `reviews`.`course_id` is not null