app/Http/Controllers/StripeWebHookController.php

    public function handleChargeSucceeded($payload) {
        try {
            $invoice_id = $payload['data']['object']["invoice"];
            $user = $this->getUserByStripeId($payload['data']['object']['customer']);
            if ($user) {
                $order = $user->orders()
                    ->where("status", Order::PENDING)
                    ->latest()
                    ->first();
                if ($order) {
                    $order->update([
                        'invoice_id' => $invoice_id,
                        'status' => Order::SUCCESS
                    ]);
---
update `orders` set `invoice_id` = 'in_1H0TPUD6YVIwolGVXKSZFRjy', `status` = 'SUCCESS', `orders`.`updated_at` = '2020-07-02 14:30:22' where `id` = 4