app/Models/Coupon.php

select * from `coupons` where `user_id` = 7 and `coupons`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `coupons` where `user_id` = 7 and `coupons`.`deleted_at` is null
---
    public function scopeForTeacher(Builder $builder) {
        return $builder
            ->where("user_id", auth()->id())
            ->paginate();