app/Models/Unit.php

select * from `units` where `course_id` = '1' order by `order` desc limit 1
---
    protected static function boot()
    {
        parent::boot();

        self::saving(function ($table) {
            $table->user_id = auth()->id();
        });

        self::creating(function ($table) {
            $last = Unit::whereCourseId(request("course_id"))
                ->orderBy('order', 'desc')
                ->take(1)
                ->first();

select * from `courses` where `courses`.`id` in (1)
select * from `units` where `user_id` = 7 limit 15 offset 0
select count(*) as aggregate from `units` where `user_id` = 7
---
    public function scopeForTeacher(Builder $builder) {
        return $builder
            ->with('course')
            ->where("user_id", auth()->id())
            ->paginate();