app/Models/User.php

select `categories`.*, `category_course`.`course_id` as `pivot_course_id`, `category_course`.`category_id` as `pivot_category_id` from `categories` inner join `category_course` on `categories`.`id` = `category_course`.`category_id` where `category_course`.`course_id` in (1, 4, 7, 8)
select `courses`.*, `course_student`.`user_id` as `pivot_user_id`, `course_student`.`course_id` as `pivot_course_id` from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `course_student`.`user_id` = 2 limit 15 offset 0
select count(*) as aggregate from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `course_student`.`user_id` = 2
---
    public function scopePurchasedCourses() {
        return $this->courses_learning()->with("categories")->paginate();